In [17]:
import pandas as pd

In [18]:
File = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%205/data/addresses.csv'
File

'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%205/data/addresses.csv'

In [19]:
df = pd.read_csv(File)
df

,John,Doe,120 jefferson st.,Riverside,NJ,08075
0,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
1,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
2,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
3,NaN,Blankman,NaN,SomeTown,SD,298
4,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [20]:
df.columns = ['First Name', 'Last Name', 'Location ', 'City','State','Area Code']

In [21]:
df

,First Name,Last Name,Location,City,State,Area Code
0,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
1,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
2,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
3,NaN,Blankman,NaN,SomeTown,SD,298
4,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [16]:
df = df[['First Name', 'Last Name', 'Location ', 'City','State','Area Code']]
df

,First Name,Last Name,Location,City,State,Area Code
0,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
1,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
2,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
3,NaN,Blankman,NaN,SomeTown,SD,298
4,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [22]:
df['First Name']

0                     Jack
1            John "Da Man"
2                  Stephen
3                      NaN
4    Joan "the bone", Anne
Name: First Name, dtype: object

In [23]:
df.loc[[1,2,3],'First Name']

1    John "Da Man"
2          Stephen
3              NaN
Name: First Name, dtype: object

In [24]:
df.iloc[[1,2],1]

1    Repici
2     Tyler
Name: Last Name, dtype: object

In [25]:
import numpy as np
import pandas as pd

In [26]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),columns = ['A','B','C'])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [16]:
df = df.transform(func = lambda x:x+5)
df

    A   B   C
0   6   7   8
1   9  10  11
2  12  13  14

In [27]:
result = df.transform(func = ['sqrt'])
result

          A         B         C
       sqrt      sqrt      sqrt
0  1.000000  1.414214  1.732051
1  2.000000  2.236068  2.449490
2  2.645751  2.828427  3.000000

In [29]:
import json
person = {
    'name':'Kavya',
    'Age':19,
    'Address':{
        'District':'Erode',
        'State':'Tamil Nadu',
        'Country':'India'
    }
}
person

{'name': 'Kavya',
 'Age': 19,
 'Address': {'District': 'Erode', 'State': 'Tamil Nadu', 'Country': 'India'}}

In [35]:
with open('person.json','w') as f:
    json.dump(person,f)
with open('person.json','r') as rf:
    content = rf.read()
    print(content)

{"name": "Kavya", "Age": 19, "Address": {"District": "Erode", "State": "Tamil Nadu", "Country": "India"}}

In [33]:
json_object = json.dumps(person,indent = 1)
json_object

'{\n "name": "Kavya",\n "Age": 19,\n "Address": {\n  "District": "Erode",\n  "State": "Tamil Nadu",\n  "Country": "India"\n }\n}'

In [41]:
with open('sample.json','w')as g:
    g.write(json_object)
    print(json_object)

{
 "name": "Kavya",
 "Age": 19,
 "Address": {
  "District": "Erode",
  "State": "Tamil Nadu",
  "Country": "India"
 }
}

In [42]:
with open('sample.json','r') as readfile:
    read_content = readfile.read()
    print(read_content)

{
 "name": "Kavya",
 "Age": 19,
 "Address": {
  "District": "Erode",
  "State": "Tamil Nadu",
  "Country": "India"
 }
}

In [46]:
with open('sample.json','r') as readfile:
    read_content = json.load(readfile)
    print(read_content)

{'name': 'Kavya', 'Age': 19, 'Address': {'District': 'Erode', 'State': 'Tamil Nadu', 'Country': 'India'}}

In [51]:
import pandas as pd
import urllib.request

In [54]:
urllib.request.urlretrieve('https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%205/data/file_example_XLSX_10.xlsx','Sample.xlsx')
df = pd.read_excel('Sample.xlsx')
df

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [58]:
import xml.etree.ElementTree as ET

In [56]:
!wget https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%205/data/Sample-employee-XML-file.xml

--2022-03-12 17:50:05--  https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%205/data/Sample-employee-XML-file.xml
Resolving cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud (cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud)... 169.63.118.104
Connecting to cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud (cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud)|169.63.118.104|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 1016 [application/xml]
Saving to: 'Sample-employee-XML-file.xml'

     0K                                                       100%  122M=0s

2022-03-12 17:50:07 (122 MB/s) - 'Sample-employee-XML-file.xml' saved [1016/1016]

In [70]:
tree = ET.parse('Sample-employee-XML-file.xml')
root = tree.getroot()
columns = ["firstname", "lastname", "title", "division", "building","room"]
df = pd.DataFrame(columns = columns)
for node in root:
    firstname = node.find('firstname').text
    lastname = node.find('lastname').text
    title = node.find('title').text
    division = node.find('division').text
    building = node.find('building').text
    room = node.find('room').text
df = df.append(pd.Series([firstname,lastname,title,division,building,room],index=columns),ignore_index = True)
df

  firstname lastname     title  division building room
0      Deep   Parekh  Designer  Computer      305   14

In [74]:
tree = ET.parse("Sample-employee-XML-file.xml")

root = tree.getroot()
columns = ["firstname", "lastname", "title", "division", "building","room"]

datatframe = pd.DataFrame(columns = columns)

for node in root: 

    firstname = node.find("firstname").text

    lastname = node.find("lastname").text 

    title = node.find("title").text 
    
    division = node.find("division").text 
    
    building = node.find("building").text
    
    room = node.find("room").text
    
dataframe = datatframe.append(pd.Series([firstname, lastname, title, division, building, room], index = columns), ignore_index = True)
dataframe

  firstname lastname     title  division building room
0      Deep   Parekh  Designer  Computer      305   14

In [75]:
df = pd.read_xml("Sample-employee-XML-file.xml")
df

  firstname lastname      title  division  building  room
0      Shiv   Mishra   Engineer  Computer       301    11
1       Yuh    Datta  developer  Computer       303     2
2     Rahil     Khan     Tester  Computer       304    10
3      Deep   Parekh   Designer  Computer       305    14

In [89]:
df.to_excel('Sample.xlsx',index=False)

In [95]:
from PIL import Image

In [101]:
urllib.request.urlretrieve('https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.pinterest.com%2Fpin%2F382665299587446191%2F&psig=AOvVaw3_hYyEC9J8snrZt95RenBk&ust=1647175527825000&source=images&cd=vfe&ved=0CAsQjRxqFwoTCNji_JXNwPYCFQAAAAAdAAAAABAK','tree.jpg')

('tree.jpg', <http.client.HTTPMessage at 0xca2e47730>)

In [99]:
img = Image.open('tree.jpg')
img

UnidentifiedImageError: cannot identify image file 'tree.jpg'

In [100]:
display(img)

NameError: name 'img' is not defined